# 마지막 노드 번호 V, 간선의 개수 N (V-1)
V, N = map(int, input().split())
# 트리의 정보가 한줄로 입력
tree = list(map(int, input().split()))
# 간선의 개수만큼 잘라서 2개 쌍
# 5 4
# 1 2 1 3 3 4 3 5
# 앞: 부모번호 뒤: 자식번호
# 1 2 / 1 3 / 3 4 / 3 5

# 부모 노드 번호를 인덱스로 사용하는 방법
left = [0] * (V + 1)
right = [0] * (V + 1)
# left[4] = 4번 노드의 왼쪽 자식 노드 번호
# right[1] = 1번 노드의 오른쪽 자식 노드 번호

# 입력 받은 트리 정보를 간선의 개수만큼 자름
for i in range(N) :
    # 부모 노드 번호 (앞)
    p = tree[i*2]
    # 자식 노드 번호 (뒤)
    c = tree[i*2+1]

    # c번은 p번 노드의 자식 노드
    # 이진트리에서 최대 자식 2개
    # 왼쪽 자식/오른쪽 자식

    # 먼저 왼쪽 자식으로 넣어보고
    # 왼쪽 자식이 이미 있으면 오른쪽 자식으로 넣음
    if left[p] == 0 :
        left[p] = c
    else :
        right[p] = c
print(left)
print(right)
