# 주사위 눈 1~6
# 주사위 N개를 던짐
# 나올 수 있는 눈금의 모든 조합을 출력하기

# 1 2 3 이랑 3 2 1 은 같은 경우이다
# branch = 6 (경우의 수)
# level = N (반복 횟수)

# 주사위 개수 입력
N = int(input())
# 가능한 주사위 눈
d = [1, 2, 3, 4, 5, 6]

# 이전 단계에서 주사위 뭐 나왔는지 입력
path = []

# i: 단계를 나타내는 변수, 던진 주사위 개수
# start: 같은 경우의 수를 선택하지 않도록 하는 장치
# 이전 단계에서 골랐던 원소 뒤에서만 고를 수 있도록
# 고를 수 있는 원소의 시작 위치를 나타낸다
def dice(i, start) :
    if i == N :
        print(path)
        return

    # j: 가능한 주사위 눈 (1~6)의 인덱스 번호
    for j in range(start, 6) :
        path.append(d[j])
        # 현재 단계에서 j번 원소를 선택했다면
        # 다음 단계는 j번 이후, 즉 j번부터 선택 가능
        dice(i + 1, j)
        path.pop()

dice(0, 0)